app/Controllers/Alquileres.php

SELECT *
FROM `vehiculos`
WHERE `vehiculos`.`id` = 6
---
    public function porVehiculo()
    {
        $vehiculoId = (int) ($this->request->getGet('vehiculo_id') ?? 0);
        $resultados = [];
        $vehiculo   = null;

        if ($vehiculoId > 0) {
            $vehiculo   = (new VehiculoModel())->find($vehiculoId);