app/Controllers/Home.php

SELECT *
FROM `clientes`
WHERE `estado` = 1
SELECT *
FROM `reservas`
WHERE `estado` = 'pendiente'
---
    public function index()
    {
        if ($this->session->get('rol') === 'admin') {
            $vehiculoModel = new VehiculoModel();
            $clienteModel  = new ClienteModel();
            $reservaModel  = new ReservaModel();
            $alquilerModel = new AlquilerModel();

            $datos = [
                'totalVehiculos'       => count($vehiculoModel->where('estado', 1)->findAll()),
                'vehiculosDisponibles' => count($vehiculoModel->disponibles()),
                'totalClientes'        => count($clienteModel->where('estado', 1)->findAll()),
                'reservasPendientes'   => count($reservaModel->where('estado', 'pendiente')->findAll()),