app/Models/AlquilerModel.php

SELECT `alquileres`.*, `vehiculos`.`marca`, `vehiculos`.`modelo`, `vehiculos`.`anio`, `vehiculos`.`precio_dia`, `clientes`.`nombre`, `clientes`.`apellido`, `clientes`.`telefono`, `usuarios`.`email`
FROM `alquileres`
JOIN `vehiculos` ON `vehiculos`.`id` = `alquileres`.`vehiculo_id`
JOIN `clientes` ON `clientes`.`id` = `alquileres`.`cliente_id`
JOIN `usuarios` ON `usuarios`.`id` = `clientes`.`usuario_id`
WHERE `alquileres`.`devuelto` = 0
ORDER BY `alquileres`.`fecha_desde` DESC
---
    public function actuales(): array
    {
        return $this->select($this->camposJoin)
            ->join('vehiculos', 'vehiculos.id = alquileres.vehiculo_id')
            ->join('clientes', 'clientes.id = alquileres.cliente_id')
            ->join('usuarios', 'usuarios.id = clientes.usuario_id')
            ->where('alquileres.devuelto', 0)
            ->orderBy('alquileres.fecha_desde', 'DESC')
            ->findAll();

SELECT `alquileres`.*, `vehiculos`.`marca`, `vehiculos`.`modelo`, `vehiculos`.`anio`, `vehiculos`.`precio_dia`, `clientes`.`nombre`, `clientes`.`apellido`, `clientes`.`telefono`, `usuarios`.`email`
FROM `alquileres`
JOIN `vehiculos` ON `vehiculos`.`id` = `alquileres`.`vehiculo_id`
JOIN `clientes` ON `clientes`.`id` = `alquileres`.`cliente_id`
JOIN `usuarios` ON `usuarios`.`id` = `clientes`.`usuario_id`
ORDER BY `alquileres`.`fecha_desde` DESC
---
    public function historial(): array
    {
        return $this->select($this->camposJoin)
            ->join('vehiculos', 'vehiculos.id = alquileres.vehiculo_id')
            ->join('clientes', 'clientes.id = alquileres.cliente_id')
            ->join('usuarios', 'usuarios.id = clientes.usuario_id')
            ->orderBy('alquileres.fecha_desde', 'DESC')
            ->findAll();

SELECT `alquileres`.*, `vehiculos`.`marca`, `vehiculos`.`modelo`, `vehiculos`.`anio`, `vehiculos`.`precio_dia`, `clientes`.`nombre`, `clientes`.`apellido`, `clientes`.`telefono`, `usuarios`.`email`
FROM `alquileres`
JOIN `vehiculos` ON `vehiculos`.`id` = `alquileres`.`vehiculo_id`
JOIN `clientes` ON `clientes`.`id` = `alquileres`.`cliente_id`
JOIN `usuarios` ON `usuarios`.`id` = `clientes`.`usuario_id`
WHERE `alquileres`.`vehiculo_id` = 6
ORDER BY `alquileres`.`fecha_desde` DESC
---
    public function porVehiculo(int $vehiculoId): array
    {
        return $this->select($this->camposJoin)
            ->join('vehiculos', 'vehiculos.id = alquileres.vehiculo_id')
            ->join('clientes', 'clientes.id = alquileres.cliente_id')
            ->join('usuarios', 'usuarios.id = clientes.usuario_id')
            ->where('alquileres.vehiculo_id', $vehiculoId)
            ->orderBy('alquileres.fecha_desde', 'DESC')
            ->findAll();