app/Models/ClienteModel.php

SELECT *
FROM `clientes`
WHERE `usuario_id` = 1
 LIMIT 1
---
    public function porUsuarioId(int $usuarioId): ?array
    {
        return $this->where('usuario_id', $usuarioId)->first();