app/Models/UsuarioModel.php

    public function buscarPorLogin(string $login): ?array
    {
        return $this->where('estado', 1)
            ->groupStart()
                ->where('usuario', $login)
                ->orWhere('email', $login)
            ->groupEnd()
            ->first();
---
SELECT *
FROM `usuarios`
WHERE `estado` = 1
AND   (
`usuario` = 'alexistincho2028@gmail.com'
OR `email` = 'alexistincho2028@gmail.com'
 )
 LIMIT 1