app/Models/VehiculoModel.php

    public function disponibles(): array
    {
        return $this->where('estado', 1)
            ->where('disponible', 1)
            ->orderBy('marca', 'ASC')
            ->findAll();
---
SELECT *
FROM `vehiculos`
WHERE `estado` = 1
AND `disponible` = 1
ORDER BY `marca` ASC

    public function listarTodos(): array
    {
        return $this->orderBy('estado', 'DESC')->orderBy('marca', 'ASC')->findAll();
---
SELECT *
FROM `vehiculos`
ORDER BY `estado` DESC, `marca` ASC

    public function listarParaSelect(): array
    {
        return $this->select('id, marca, modelo, anio, estado')
            ->orderBy('marca', 'ASC')
            ->findAll();
---
SELECT `id`, `marca`, `modelo`, `anio`, `estado`
FROM `vehiculos`
ORDER BY `marca` ASC